# Напишите несколько строк кода, выводящих на экран ваше имя и почтовый адрес.
# Адрес напишите в формате, принятом в вашей стране.
# Никакого ввода от пользователя ваша первая программа принимать не будет, только вывод на экран и больше ничего.

name = 'Ekaterina Goloveshkina'
address = "220062, город Минск, ул. Ильянская 4, кв. 54"
print(f'Имя получателя: {name}, почтовый адрес: {address}')